SELECT count(*) AS "КОЛИЧЕСТВО_В_ГРУППЕ", "Н_УЧЕНИКИ"."ГРУППА" FROM
    "Н_УЧЕНИКИ" INNER JOIN
        "Н_ГРУППЫ_ПЛАНОВ" INNER JOIN
            "Н_ОТДЕЛЫ" INNER JOIN "Н_ПЛАНЫ"
            ON "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'ВТ'
                AND "Н_ПЛАНЫ"."ОТД_ИД_ЗАКРЕПЛЕН_ЗА" = "Н_ОТДЕЛЫ"."ИД"
                AND EXTRACT(YEAR FROM "Н_ПЛАНЫ"."ДАТА_УТВЕРЖДЕНИЯ") = '2011'
        ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    ON "Н_УЧЕНИКИ"."ГРУППА" = "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА" HAVING count(*) < 10;