SELECT count(*) FROM "Н_ВЕДОМОСТИ"
    INNER JOIN "Н_ЛЮДИ"
        INNER JOIN "Н_УЧЕНИКИ"
        ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND "ГРУППА" = '3100'
    ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
           AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                   NOT IN(SELECT "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" FROM "Н_ВЕДОМОСТИ"
                                                         WHERE "ОЦЕНКА" = '2'
                                                            OR "ОЦЕНКА" = '3'
                                                            OR "ОЦЕНКА" = 'незачет'
                                                            OR "ОЦЕНКА" = 'неявка');