SELECT "ГРУППА", "Н_ЛЮДИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "П_ПРКОК_ИД", "СОСТОЯНИЕ" FROM "Н_ЛЮДИ"
    INNER JOIN "Н_УЧЕНИКИ"
        INNER JOIN "Н_ПЛАНЫ"
            INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ"
            ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                   AND ("НАИМЕНОВАНИЕ" = 'Очная' OR "НАИМЕНОВАНИЕ" = 'Заочная')
        ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
               AND "КУРС" = 1 AND "Н_ПЛАНЫ"."ДАТА_УТВЕРЖДЕНИЯ" > '2002-09-01'::timestamp
    ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД";